

[info]
drivername=[DRIVERNAME]
trusted=
symbolfile=[SYMBOLINSTALLPATH]\rsperfctr.h


[languages]
009=English
004=Chinese (Simplified)


[text]
SERVER_OBJECT_009_NAME=[COUNTERPREFIXSERVICENAME]:Service
SERVER_OBJECT_009_HELP=Statistics related to SQL Report Server Service


SERVER_REQUESTS_009_NAME=Requests/sec
SERVER_REQUESTS_009_HELP=Number of requests executed per second. This represents the current throughput of the application.


SERVER_REQUESTS_TOTAL_009_NAME=Requests Total
SERVER_REQUESTS_TOTAL_009_HELP=The total number of requests received by the report server service since service start up.


SERVER_ERRORS_009_NAME=Errors/sec
SERVER_ERRORS_009_HELP=Number of errors that occur during the execution of HTTP requests (error codes 400s and 500s) per second.


SERVER_ERRORS_TOTAL_009_NAME=Errors Total
SERVER_ERRORS_TOTAL_009_HELP=The total number of errors that occur during the execution of HTTP requests (error codes 400s and 500s).


SERVER_BYTES_SENT_009_NAME=Bytes Sent/sec
SERVER_BYTES_SENT_009_HELP=Rate of bytes sent per second.


SERVER_BYTES_SENT_TOTAL_009_NAME=Bytes Sent Total
SERVER_BYTES_SENT_TOTAL_009_HELP=Number of bytes sent.


SERVER_BYTES_RECEIVED_009_NAME=Bytes Received/sec
SERVER_BYTES_RECEIVED_009_HELP=Rate of bytes received per second.


SERVER_BYTES_RECEIVED_TOTAL_009_NAME=Bytes Received Total
SERVER_BYTES_RECEIVED_TOTAL_009_HELP=Number of bytes received.


SERVER_ACTIVE_CONNECTIONS_009_NAME=Active Connections
SERVER_ACTIVE_CONNECTIONS_009_HELP=Number of connections active against server.


SERVER_LOGON_ATTEMPTS_009_NAME=Logon Attempts/sec
SERVER_LOGON_ATTEMPTS_009_HELP=Rate of logon attempts.


SERVER_LOGON_ATTEMPTS_TOTAL_009_NAME=Logon Attempts Total
SERVER_LOGON_ATTEMPTS_TOTAL_009_HELP=Number of logon attempts for RSWindows* authentication types. Returns 0 for Custom authentication


SERVER_LOGON_SUCCESSES_009_NAME=Logon Successes/sec
SERVER_LOGON_SUCCESSES_009_HELP=Rate of successful logons.


SERVER_LOGON_SUCCESSES_TOTAL_009_NAME=Logon Successes Total
SERVER_LOGON_SUCCESSES_TOTAL_009_HELP=Number of successful logons for RSWindows* authuentication types. Returns 0 for Custom authentication.


SERVER_REQUESTS_UNAUTHORIZED_009_NAME=Requests Not Authorized
SERVER_REQUESTS_UNAUTHORIZED_009_HELP=Number of requests failing with HTTP 401 error code.


SERVER_REQUESTS_REJECTED_009_NAME=Requests Rejected
SERVER_REQUESTS_REJECTED_009_HELP=Total number of requests not executed because of insufficient server resources. This counter represents the number of requests that return a 503 HTTP status code, indicating that the server is too busy.


SERVER_REQUESTS_DISCONNECTED_009_NAME=Requests Disconnected
SERVER_REQUESTS_DISCONNECTED_009_HELP=Number of requests that have been disconnected due to a communication failure.


SERVER_REQUESTS_EXECUTING_009_NAME=Requests Executing
SERVER_REQUESTS_EXECUTING_009_HELP=Number of requests currently executing.


SERVER_MEMORY_PRESSURE_STATE_009_NAME=Memory Pressure State
SERVER_MEMORY_PRESSURE_STATE_009_HELP=A number from 1-5 indicating the current memory state of the server. 1:No pressure, 2:Low Pressure,3:Medium Pressure,4:High Pressure,5:Exceeded Pressure.


SERVER_MEMORY_SHRINK_COUNT_009_NAME=Memory Shrink Notifications/sec
SERVER_MEMORY_SHRINK_COUNT_009_HELP=Number of shrink notifications the server issued in the last second. Indicates how often the server believes it is under memory pressure.


SERVER_MEMORY_SHRINK_AMOUNT_009_NAME=Memory Shrink Amount
SERVER_MEMORY_SHRINK_AMOUNT_009_HELP=Number of bytes the server requested to shrink.


SERVER_TASKS_QUEUED_009_NAME=Tasks Queued
SERVER_TASKS_QUEUED_009_HELP=Tasks Queued represents the number of tasks that are waiting for a thread to become available for processing. Each request made to the report server corresponds to one or more tasks. This counter represents only the number of tasks that are ready for processing; it does not include the number of tasks that are currently running.


SERVER_OBJECT_004_NAME=[COUNTERPREFIXSERVICENAME]:Service
SERVER_OBJECT_004_HELP=与 SQL 报表服务器服务有关的统计信息


SERVER_REQUESTS_004_NAME=Requests/sec
SERVER_REQUESTS_004_HELP=每秒执行的请求数。这表示应用程序的当前吞储量。


SERVER_REQUESTS_TOTAL_004_NAME=Requests Total
SERVER_REQUESTS_TOTAL_004_HELP=自报表服务器服务启动后，该服务接收到的请求总数。


SERVER_ERRORS_004_NAME=Errors/sec
SERVER_ERRORS_004_HELP=在执行 HTTP 请求期间每秒发生的错误(错误代码 400s 和 500s)数。


SERVER_ERRORS_TOTAL_004_NAME=Errors Total
SERVER_ERRORS_TOTAL_004_HELP=在执行 HTTP 请求期间发生的错误(错误代码 400s 和 500s)总数。


SERVER_BYTES_SENT_004_NAME=Bytes Sent/sec
SERVER_BYTES_SENT_004_HELP=每秒发送字节的速率。


SERVER_BYTES_SENT_TOTAL_004_NAME=Bytes Sent Total
SERVER_BYTES_SENT_TOTAL_004_HELP=已发送的字节数。


SERVER_BYTES_RECEIVED_004_NAME=Bytes Received/sec
SERVER_BYTES_RECEIVED_004_HELP=每秒接收字节的速率。


SERVER_BYTES_RECEIVED_TOTAL_004_NAME=Bytes Received Total
SERVER_BYTES_RECEIVED_TOTAL_004_HELP=已接收到的字节数。


SERVER_ACTIVE_CONNECTIONS_004_NAME=Active Connections
SERVER_ACTIVE_CONNECTIONS_004_HELP=服务器上的活动连接数。


SERVER_LOGON_ATTEMPTS_004_NAME=Logon Attempts/sec
SERVER_LOGON_ATTEMPTS_004_HELP=登录尝试的速率。


SERVER_LOGON_ATTEMPTS_TOTAL_004_NAME=Logon Attempts Total
SERVER_LOGON_ATTEMPTS_TOTAL_004_HELP=RSWindows* 身份验证类型的登录尝试次数。对“自定义”身份验证返回 0


SERVER_LOGON_SUCCESSES_004_NAME=Logon Successes/sec
SERVER_LOGON_SUCCESSES_004_HELP=成功登录的速率。


SERVER_LOGON_SUCCESSES_TOTAL_004_NAME=Logon Successes Total
SERVER_LOGON_SUCCESSES_TOTAL_004_HELP=RSWindows* 身份验证类型的成功登录次数。对“自定义”身份验证返回 0。


SERVER_REQUESTS_UNAUTHORIZED_004_NAME=Requests Not Authorized
SERVER_REQUESTS_UNAUTHORIZED_004_HELP=失败时显示 HTTP 401 错误代码的请求的数量。


SERVER_REQUESTS_REJECTED_004_NAME=Requests Rejected
SERVER_REQUESTS_REJECTED_004_HELP=因服务器资源不足而未执行的请求总数。该计数器表示返回 503 HTTP 状态代码的请求数量，该代码指示服务器太忙。


SERVER_REQUESTS_DISCONNECTED_004_NAME=Requests Disconnected
SERVER_REQUESTS_DISCONNECTED_004_HELP=因通信失败而断开连接的请求数量。


SERVER_REQUESTS_EXECUTING_004_NAME=Requests Executing
SERVER_REQUESTS_EXECUTING_004_HELP=当前执行的请求数。


SERVER_MEMORY_PRESSURE_STATE_004_NAME=Memory Pressure State
SERVER_MEMORY_PRESSURE_STATE_004_HELP=从 1-5 的数字表示服务器的当前内存状态。1:无压力，2:低压力，3:中压力，4:高压力，5:超高压力。


SERVER_MEMORY_SHRINK_COUNT_004_NAME=Memory Shrink Notifications/sec
SERVER_MEMORY_SHRINK_COUNT_004_HELP=在最近一秒服务器发出的收缩通知的数量。指示服务器认为有内存压力的频率。


SERVER_MEMORY_SHRINK_AMOUNT_004_NAME=Memory Shrink Amount
SERVER_MEMORY_SHRINK_AMOUNT_004_HELP=服务器请求收缩的字节数。


SERVER_TASKS_QUEUED_004_NAME=Tasks Queued
SERVER_TASKS_QUEUED_004_HELP=Tasks Queued 表示正等待线程处理的任务数。向报表服务器发出的每个请求都与一个或多个任务对应。此计数器只表示可以处理的任务数量，不包括当前正在运行的任务数量。


